#### TopographyEditScope Members

---

|  |
| --- |
| TopographyEditScope Class   Constructors   Methods   Properties   See Also |

The  TopographyEditScope  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TopographyEditScope | Instantiates a TopographyEditScope object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | Cancels the edit scope. (Inherited from  EditScope  .) |
| Public method | Commit | Finishes the edit scope. (Inherited from  EditScope  .) |
| Public method | Dispose | (Inherited from  EditScope  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | Start | Starts a topography surface edit mode for an existing TopographySurface element. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. (Inherited from  EditScope  .) |
| Public property | IsPermitted | Tells if the edit scope is permitted to start. (Inherited from  EditScope  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  EditScope  .) |

# See Also

TopographyEditScope Class

Autodesk.Revit.DB.Architecture Namespace